/** @License 

Copyright (c) 2014 paulll

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

*/

var dicts = {
	fe: {
		lastnames: 'Смирнова Иванова Кузнецова Попова Соколова Лебедева Козлова Новикова Морозова Петрова Волкова Соловьева Васильева Зайцева Павлова Семенова Голубева Виноградова Богданова Воробьева Федорова Михайлова Беляева Тарасова Белова Комарова Орлова Киселева Макарова Андреева Ковалева Ильина Гусева Титова Кузьмина Кудрявцева Баранова Куликова Алексеева Степанова Яковлева Сорокина Сергеева Романова Захарова Борисова Королева Герасимова Пономарева Григорьева Лазарева Медведева Ершова Никитина Соболева Рябова Полякова Цветкова Данилова Жукова Фролова Журавлева Николаева Крылова Максимова Сидорова Осипова Белоусова Федотова Дорофеева Егорова Матвеева Боброва Дмитриева Калинина Анисимова Петухова Антонова Тимофеева Никифорова Веселова Филиппова Маркова Большакова Суханова Миронова Ширяева Александрова Коновалова Шестакова Казакова Ефимова Денисова Громова Фомина Давыдова Мельникова Щербакова Блинова Колесникова Карпова Афанасьева Власова Маслова Исакова Тихонова Аксенова Гаврилова Родионова Котова Горбунова Кудряшова Быкова Зуева Третьякова Савельева Панова Рыбакова Суворова Абрамова Воронова Мухина Архипова Трофимова Мартынова Емельянова Горшкова Чернова Овчинникова Селезнева Панфилова Копылова Михеева Галкина Назарова Лобанова Лукина Белякова Потапова Некрасова Хохлова Жданова Наумова Шилова Воронцова Ермакова Дроздова Игнатьева Савина Логинова Сафонова Капустина Кириллова Моисеева Елисеева Кошелева Костина Горбачева Орехова Ефремова Исаева Евдокимова Калашникова Кабанова Носкова Юдина Кулагина Лапина Прохорова Нестерова Харитонова Агафонова Муравьева Ларионова Федосеева Зимина Пахомова Шубина Игнатова Филатова Крюкова Рогова Кулакова Терентьева Молчанова Владимирова Артемьева Гурьева Зиновьева Гришина Кононова Дементьева Ситникова Симонова Мишина Фадеева Комиссарова Мамонтова Носова Гуляева Шарова Устинова Вишнякова Евсеева Лаврентьева Брагина Константинова Корнилова Авдеева Зыкова Бирюкова Шарапова Никонова Щукина Дьячкова Одинцова Сазонова Якушева Красильникова Гордеева Самойлова Князева Беспалова Уварова Шашкова Бобылева Доронина Белозерова Рожкова Самсонова Мясникова Лихачева Бурова Сысоева Фомичева Русакова Стрелкова Гущина Тетерина Колобова Субботина Фокина Блохина Селиверстова Пестова Кондратьева Силина Меркушева Лыткина Туров'.split(' '),
		firstnames: 'Августа Августина Авдотья Аврелия Аврея Аврора Агапа Агапия Агарь Агита Агафа Агафоклия Агафоника Агафья Агафия Аглаида Аглая Агна Агнесса Агния Аграфена Агриппина Ада Аделаида Аделина Аделла Адель Адельфина Адина Адолия Адриана Аза Азалия Азелла Аида Акилина Аксинья Аксиния Акулина Алевтина Александра Александрина Алексина Алёна Алина Алиса Алла Алфея Альберта Альбертина Альбина Альвина Альфия Амалия Амата Амелфа Анастасия Анатолия Ангела Ангелика Ангелина Анджела Андрея Андрона Андроника Анжелика Анисья Анисия Анна Антигона Антониана Антонида Антонина Антония Анфима Анфиса Анфия Анфуса Аполлинария Аполлония Апраксин Апрелия Апфия Аргентея Ариадна Арина Ария Арминия Арсения Артемида Артемия Аста Астра Афанасия Аэлита Беата Беатриса Белла Бенедикта Берта Бландина Богдана Божена Болеслава Борислава Бояна Бронислава Валентина Валенсия Валерия Ванда Васёна Василида Василина Василиса Василия Василла Васса Вацлава Вевея Велимира Велислава Венедикта Венуста Венцеслава Вера Вереника Вероника Вербния Веселина Веста Вестита Вива Вивея Вивиана Видина Викентия Викторина Виктбрия Вила Вилена Виленина Вильгельмина Виолетта Виргиния Виринея Вита Виталика Виталина Виталия Витольда Влада Владилена Владимира Владислава Владлена Воислава Воля Всеслава Гала Галата Галатея Гали Галина Галла Галя Гая Геласия Гемелла Гемина Гения Геннадия Геновефа Генриетта Георгина Гера Германа Гертруда Гея Глафира Гликерия Глорибза Голиндуха Гонеста Гонората Горгония Горислава Гортензия Градислава Грета Далила Даная Дарья Дария Дебора Деена Декабрена Денесия Денница Дея Диана Дигна Дина Диодора Дионина Дия Доброгнева Добромила Добромира Доброслава Доминика Домитилла Домна Домника Домникия Домнина Донара Доната Дора Дорофея Доса Досифея Дросида Дуклида Ева Евангелина Еванфия Евгения Евдокия Евдоксия Евлалия Евлампия Евмения Евминия Евника Евникия Евномия Евпраксия Евсевия Евстафия Евстолия Евтихия Евтропия Евфалия Евфимия Евфросиния Екатерина Елена Елизавета Еликонида Епистима Епистимия Ермиония Ефимия Ефимья Ефросиния Ефросинья Жанна Жозефина Зара Зарема Зарина Зари Зарина Звезда Земфира Зенона Зина Зинаида Зиновия Злата Зоя Ива Иванна Ида Идея Изабелла Изида Изольда Илария Илия Ильина Инга Инесса Инна Иоанна Иовилла Иола Иоланта Ипполита Ираида Ирина Ирма Исидора Ифигения Ия Каздоя Казимира Калерия Калида Калиса Каллиникия Каллиста Каллисфения Кама Камилла Кандида Капитолина Карина Каролина Касиния Келестина Керкира Кетевань Кикилия Кима Кира Кириакия Кириана Кирьяна Кирилла Клавдия Клара Клариса Клементина Клеопатра Конкордия Констанция Корнелия Кристина Ксанфиппа Ксения Купава Лавиния Лавра Лада Лариса Лаура Леда Лейла Лемира Ленина Леокадия Леонида Леонила Леонина Лебния Лея Лиана Ливия Лидия Лилиана Лилия Лина Лира Лия Лилия Лонгина Лора Лота Луиза Лукерья Лукиана Лукия Лукреция Любава Любовь Любомила Любомира Людмила Люцина Люция Мавра Магда Магдалина Магна Маина Майя Макрина Максима Малания Малинья Малина Мальвина Мамелфа Манефа Маргарита Мариам Мариамна Мариана Марианна Марьина Мариетта Марина Марионилла Мария Марья Марка Маркеллина Маркиана Марксина Марлена Марта Мартина Мартиниана Марфа Марья Мария Марьяна Марианна Мастридия Матильда Матрёна Матрона Мая Медея Мелания Меланья Мелитика Меркурия Мерона Милана Милена Милица Милия Милослава Милютина Мина Минна Минодора Мира Миропия Мирослава Мирра Митродора Михайлина Млада Модеста Моика Моника Мстислава Муза Нада Надежда Нана Наркисса Настасия Настасья Наталия Наталья Нелли Ненила Неонила Нида Ника Нила Нимфа Нимфодора Нина Нинель Новелла Нонна Ноэми Ноябрина Нунехия Оксана Октавия Октябрина Олдама Оливия Олимпиада Олимпиодора Олимпия Ольга Ольда Офелия Павла Павлина Паисия Паллада Паллидия Пальмира Параскева Патрикия Пелагея Перегрина Перпетуя Петра Петрина Петронилла Петрония Пиама Пинна Плакида Плакилла Платонида Победа Полактия Поликсена Поликсения Полина Поплия Правдина Прасковья Препедигна Прискилла Просдока Пульхерия Пульхерья Рада Радана Радислава Радмила Радомира Радосвета Радослава Радость Раиса Рафаила Рахиль Ревекка Ревмира Регина Рема Рената Римма Рипсимия Роберта Рогнеда Роза Розалина Розалинда Розалия Розина Роксана Романа Ростислава Русина Руслана Руфина Руфиниана Руфь Сабина Савватия Савелла Савина Саломея Сильвия Самона Сарра Сатира Светислава Светлана Светозара Святослава Севастьяна Северина Секлетея Секлетинья Селена Селестина Селина Серафима Сибилла Сильва Сильвана Сильвестра Сильвия Симона Синклитикия Сира Слава Снандулия Снежана Сола Соломонида Сосипатра Софрония Софья София Станислава Стелла Степанида Стефанида Стефания Сусанна Сюзанна Тавифа Таисия Таисья Тамара Тарасия Татьяна Текуса Тереза Тигрия Тихомира Тихослава Тома Томила Транквиллина Трифена Трофима Улита Ульяна Урбана Урсула Устина Устиния Устинья Фабиана Фавста Фавстина Фаина Фантика Феврония Февронья Федоза Федора Федосия Федосья Федотия Федотья Федула Фёкла Фекуса Феликса Фелица Фелицата Фелициана Фелицитата Фелиция Феогния Феодора Феодосия Феодота Феодотия Феодула Феодулия Феозва Феоктиста Феона Феонилла Фебния Феопистия Феосовия Феофания Феофила Фервуфа Фессалоника Фессалоникия Фетиния Фетинья Фея Фива Фивея Филарета Филиппа Филиппин Филомена Филонилла Филофея Фиста Флавия Флёна Флора Флорентина Флоренция Флориана Флорида Фомаида Фортуната Фотина Фотиния Фотинья Франциска Фрида Фридерика Хаврония Хариесса Хариса Харита Харитина Хиония Хриса Хрисия Христиана Христина Цвета Цветана Целестина Цецилия Шарлотта Шушаника Эвелина Эгина Эдит Элеонора Элисса Элла Эллада Эллина Элоиза Эльвира Эмилиана Эмилия Эмма Эннафа Эра Эрнеста Эрнестина Эсмеральда Эсфирь Юдифь Юлиана Юлиания Юлия Юния Юнона Юрия Юстина Ядвига Яна Янина Ярослава'.split(' '),
		midnames: 'Александровна Алексеевна Анатольевна Андреевна Антоновна Аркадьевна Артемовна Богдановна Борисовна Валентиновна Валерьевна Васильевна Викторовна Виталиевна Владимировна Владиславовна Вячеславовна Геннадиевна Георгиевна Григорьевна Даниловна Дмитриевна Евгеньевна Егоровна Ефимовна Ивановна Игоревна Ильинична Иосифовна Кирилловна Константиновна Леонидовна Львовна – Максимовна Матвеевна Михайловна Николаевна Олеговна Павловна Петровна Платоновна Робертовна Романовна Семеновна Сергеевна Станиславовна Степановна Тарасовна Тимофеевна Федоровна Феликсовна Филипповна Эдуардовна Юрьевна Яковлевна Ярославовна'.split(' ')
	},
	ma: {
		lastnames: 'Смирнов Иванов Кузнецов Попов Соколов Лебедев Козлов Новиков Морозов Петров Волков Соловьев Васильев Зайцев Павлов Семенов Голубев Виноградов Богданов Воробьев Федоров Михайлов Беляев Тарасов Белов Комаров Орлов Киселев Макаров Андреев Ковалев Ильин Гусев Титов Кузьмин Кудрявцев Баранов Куликов Алексеев Степанов Яковлев Сорокин Сергеев Романов Захаров Борисов Королев Герасимов Пономарев Григорьев Лазарев Медведев Ершов Никитин Соболев Рябов Поляков Цветков Данилов Жуков Фролов Журавлев Николаев Крылов Максимов Сидоров Осипов Белоусов Федотов Дорофеев Егоров Матвеев Бобров Дмитриев Калинин Анисимов Петухов Антонов Тимофеев Никифоров Веселов Филиппов Марков Большаков Суханов Миронов Ширяев Александров Коновалов Шестаков Казаков Ефимов Денисов Громов Фомин Давыдов Мельников Щербаков Блинов Колесников Карпов Афанасьев Власов Маслов Исаков Тихонов Аксенов Гаврилов Родионов Котов Горбунов Кудряшов Быков Зуев Третьяков Савельев Панов Рыбаков Суворов Абрамов Воронов Мухин Архипов Трофимов Мартынов Емельянов Горшков Чернов Овчинников Селезнев Панфилов Копылов Михеев Галкин Назаров Лобанов Лукин Беляков Потапов Некрасов Хохлов Жданов Наумов Шилов Воронцов Ермаков Дроздов Игнатьев Савин Логинов Сафонов Капустин Кириллов Моисеев Елисеев Кошелев Костин Горбачев Орехов Ефремов Исаев Евдокимов Калашников Кабанов Носков Юдин Кулагин Лапин Прохоров Нестеров Харитонов Агафонов Муравьев Ларионов Федосеев Зимин Пахомов Шубин Игнатов Филатов Крюков Рогов Кулаков Терентьев Молчанов Владимиров Артемьев Гурьев Зиновьев Гришин Кононов Дементьев Ситников Симонов Мишин Фадеев Комиссаров Мамонтов Носов Гуляев Шаров Устинов Вишняков Евсеев Лаврентьев Брагин Константинов Корнилов Авдеев Зыков Бирюков Шарапов Никонов Щукин Дьячков Одинцов Сазонов Якушев Красильников Гордеев Самойлов Князев Беспалов Уваров Шашков Бобылев Доронин Белозеров Рожков Самсонов Мясников Лихачев Буров Сысоев Фомичев Русаков Стрелков Гущин Тетерин Колобов Субботин Фокин Блохин Селиверстов Пестов Кондратьев Силин Меркушев Лыткин Туров'.split(' '),
		firstnames: 'Абакум Абрам Абросим Аввакум Август Авдей Авдий Авель Авенир Аверий Аверкий Аверьян Авксентий Аврам Аврелиан Автоном Агап Агапий Агапит Агафангел Агафон Аггей Адам Адриан Азар Азарий Акакий Акила Аким Акиндин Акинф Акинфий Аксён Аксентий Александр Алексей Алексий Альберт Альфред Амвросий Амос Амфилохий Ананий Анастасий Анатолий Андрей Андриан Андрон Андроний Андроник Анект Анемподист Аникей Аникий Аникита Анисий Анисим Антиох Антип Антипа Антипий Антон Антонин Антроп Антропий Ануфрий Аполлинарий Аполлон Аполлос Ардалион Ардальон Ареф Арефий Арий Аристарх Аристид Аркадий Арнольд Арон Арсений Арсентий Артамон Артём Артемий Артур Архип Асаф Асафий Аскольд Афанасий Афиноген Афинодор Африкан Бажен Бенедикт Богдан Болеслав Бонифат Бонифатий Борис Борислав Бронислав Будимир Вавила Вадим Валентин Валериан Валерий Варлам Варламий Варнава Варсоноф Варсонофий Варфоломей Василий Вассиан Велизар Велимир Венедикт Вениамин Венцеслав Веньямин Викентий Виктор Викторий Викул Викула Вилен Виленин Вильгельм Виссарион Вит Виталий Витовт Витольд Владилен Владимир Владислав Владлен Влас Власий Вонифат Вонифатий Всеволод Всеслав Вукол Вышеслав Вячеслав Гавриил Гаврил Гаврила Галактион Гедеон Гедимин Геласий Гелий Геннадий Генрих Георгий Герасим Гервасий Герман Гермоген Геронтий Гиацинт Глеб Гораций Горгоний Гордей Гостомысл Гремислав Григорий Гурий Гурьян Давид Давыд Далмат Даниил Данил Данила Дементий Демид Демьян Денис Денисий Димитрий Диомид Дионисий Дмитрий Добромысл Добрыня Довмонт Доминик Донат Доримедонт Дормедонт Дормидбнт Дорофей Досифей Евгений Евграф Евграфий Евдоким Евлампий Евлогий Евмен Евмений Евсей Евстафий Евстахий Евстигней Евстрат Евстратий Евтихий Евфимий Егор Егорий Елизар Елисей Елистрат Елпидифор Емельян Епифан Епифаний Еремей Ермий Ермил Ермила Ермилий Ермолай Ерофей Ефим Ефимий Ефрем Ефремий Захар Захарий Зенон Зиновий Зосим Зосима Иаким Иакинф Иван Игнат Игнатий Игорь Иероним Измаил Измарагд Изосим Изот Изяслав Илларион Илиодор Илья Иннокентий Иоанн Йов Иона Иосафат Иосиф Ипат Ипатий Ипполит Ираклий Иринарх Ириней Иродион Исаак Исаакин Исай Исак Исакий Исидор Иустин Казимир Каллимах Каллиник Каллиопий Каллист Каллистрат Каллисфен Калуф Кандидий Кантидиан Капик Капитон Карион Карл Карп Кастрихий Касьян  Ким Киприан Кир Кириак Кирик Кирилл Кирсан Клавдий Клим Климент Климентий Кондрат Кондратий Конон Конрад Константин Корней Корнелий Корнил Корнилий Ксенофонт Кузьма Куприян Лавр Лаврентий Ладимир Лазарь Ларион Лев Леон Леонард Леонид Леонтий Леопольд Логвин Лонгин Лука Лукан Лукьян Любим Любомир Любомысл Люциан Мавр Маврикий Мавродий Май Макар Макарий Македон Македоний Максим Максимиан Максимилиан Малх Мануил Марат Мардарий Мариан Марин Марк Маркел Маркиан Марлен Мартимьян Мартин Мартиниан Мартирий Мартин Мартьян Матвей Мелентий Мелетий Меркул Меркурий Мефодий Мечислав Милан Милен Милий Мина Минай Мирон Мирослав Мисаил Митрофан Митрофаний Михаил Михей Модест Моисей Мокей Мокий Мстислав Назар Назарий Наркис Натан Наум Нестер Нестор Нефёд Никандр Никанор Никита Никифор Никодим Николай Никон Нил Нифонт Олег Олимпий Онисим Онисифор Онуфрий Орест Осип Оскар Остап Остромир Павел Павлин Паисий Палладий Памфил Памфилий Панкрат Панкратий Пантелей Пантелеймон Панфил Парамон Пармен Парфён Парфений Парфентий Патрикей Патрикий Пафнутий Пахом Пахомий Перфилий Пётр Пимен Питирим Платон Полиевкт Полиект Поликарп Поликарпий Порфир Порфирий Потап Потапий Пров Прокл Прокоп Прокопий Прокофий Протас Протасий Прохор Радий Радим Радислав Радован Ратибор  Ратмир Рафаил Роберт Родион Роман Ростислав Рубен Рувим Рудольф Руслан Рюрик Савва Савватей Савватий Савёл Савелий Саверий Савин  Савиниан Сакердон Салтан Самбила Самсон Самсоний Самуил Светозар Свирид Святополк Святослав Себастьян Севастьян Северин Северьян Селиван Селивёрст Селифан Семён Семион Серапион Серафим Сергей Сигизмунд Сидор Сила Силан Силантий Силуян Сильван Сильвестр Симон Смарагд Созон Созонт Созонтий Сократ Соломон Сосипатр Софон Софоний Софрон Софроний Спартак Спиридон Спиридоний Станимир Стахий Станислав Степан Стоян Стратбник Сысой Тарас Твердислав Творимир Терентий Тертий Тигран Тигрий Тимофей Тимур Тит Тихон Тристан Трифилий Трифон Трофим Увар Ульян Устин Фабиан Фадей Фалалей Фатьян Фёдор Федос Федосей Федосий Федот Федотий Федул Феликс Фемистокл Феогност Феоктист Феофан Феофил Феофилакт Ферапонт Филарет Филат Филимон Филипий Филипп Филофей Фирс Флавиан Флавий Флегонт Флорентий Флорентин Флориан Фока Фома Фортунат Фотий Фридрих Фрол Харитон Харитоний Харлам Харламп Харлампий Хрисанф Христофор Эдуард Эмилий Эмиль Эммануил Эразм Эраст Эрнест Эрнст Ювеналий Юлиан Юлий Юрий Юстиниан Яким Яков Якуб Ян Януарий Ярополк Ярослав'.split(' '),
		midnames: 'Александрович Алексеевич Анатольевич Андреевич Антонович Аркадьевич Артемович Богданович Борисович Валентинович Валерьевич Васильевич Викторович Витальевич Владимирович Владиславович Вячеславович Геннадиевич Георгиевич Григорьевич Данилович Денисович Дмитриевич Евгеньевич Егорович Ефимович Иванович Игоревич Ильич Иосифович Кириллович Константинович Леонидович Львович Максимович Матвеевич Михайлович Николаевич Олегович Павлович Петрович Платонович Робертович Романович Семенович Сергеевич Станиславович Степанович Тарасович Тимофеевич Федорович Феликсович Филиппович Эдуардович Юрьевич Яковлевич Ярославович'.split(' '),
	},
	
	colors: 'Чёрный, Синий, Красный, Зеленый, Желтый, Розовый, Янтарный, Бирюзовый, Фиолетовый, Малиновый, Салатный, Оранжевый, Бежевый, Коричневый, Голубой, Белый, Серый'.split(', '),
	

	addr: {
		spb: function (callback) {
			var R = 8.6/105; // Радиус. 8.6 - километры, 105 - приблизительное отношение градуса к километру
			var x = 30.403657; // Долгота
			var y = 59.957102; // Широта 

			// Получаем случайную точку в радиусе
			var pos = randomDot(x, y, R);

			// Запрашиваем у Яндекс.Карт ближайшее здание к точке
			window.mapcb = function (data) {
				if (!data.response.GeoObjectCollection.featureMember[0]) {
					dicts.addr.spb(callback);
				} else {
					callback(data.response.GeoObjectCollection.featureMember[0].GeoObject.metaDataProperty.GeocoderMetaData.text);
				}
			};
			var scr = document.createElement('script');
			scr.src = 'https://geocode-maps.yandex.ru/1.x/?geocode='+pos.x+','+pos.y+'&format=json&callback=mapcb&kind=house&results=1';
			document.getElementsByTagName('head')[0].appendChild(scr);
		},
		msk: function (callback) {
			var R = 20/105;
			var x = 37.619899; 
			var y = 55.753676;

			var pos = randomDot(x, y, R);

			window.mapcb = function (data) {
				if (!data.response.GeoObjectCollection.featureMember[0]) {
					dicts.addr.msk(callback);
				} else {
					callback(data.response.GeoObjectCollection.featureMember[0].GeoObject.metaDataProperty.GeocoderMetaData.text);
				}
			};

			var scr = document.createElement('script');
			scr.src = 'https://geocode-maps.yandex.ru/1.x/?geocode='+pos.x+','+pos.y+'&format=json&callback=mapcb&kind=house&results=1';
			document.getElementsByTagName('head')[0].appendChild(scr);
		},
		other: function (callback) {
			var R = 560/105;
			var x = 37.619899; 
			var y = 55.753676;

			var pos = randomDot(x, y, R);

			window.mapcb = function (data) {
				if (!data.response.GeoObjectCollection.featureMember[0]) {
					dicts.addr.other(callback);
				} else {
					callback(data.response.GeoObjectCollection.featureMember[0].GeoObject.metaDataProperty.GeocoderMetaData.text);
				}
			};

			var scr = document.createElement('script');
			scr.src = 'https://geocode-maps.yandex.ru/1.x/?geocode='+pos.x+','+pos.y+'&format=json&callback=mapcb&kind=house&results=1';
			document.getElementsByTagName('head')[0].appendChild(scr);
		}
	},

	// Телефонные коды. Формат: [строка код, целое первый_номер, целое количество_номеров]
	// База номеров взята тут: https://github.com/antirek/numcap
	tel: {
		spb: [["901",3000000,900000],["901",3910000,90000],["901",9700000,100000],["903",920000,80000],["904",3300000,100000],["904",5100000,100000],["904",5500000,100000],["904",6000000,200000],["904",6300000,200000],["905",2000000,300000],["905",2300000,70000],["905",2500000,400000],["906",2250000,50000],["906",2400000,400000],["909",5770000,170000],["911",0,400000],["911",800000,2200000],["911",7000000,1000000],["911",8100000,400000],["911",9000000,1000000],["921",900000,100000],["921",1110000,10000],["921",1800000,100000],["921",3000000,1500000],["921",5500000,500000],["921",6300000,300000],["921",7400000,600000],["921",8450000,50000],["921",8550000,1450000],["929",1000000,200000],["931",0,90000],["931",2000000,1840000],["931",5300000,140000],["931",5760000,10000],["931",5770000,200000],["931",9800000,200000],["941",3000000,1000],["941",8200000,2000],["950",0,500000],["950",2200000,100000],["951",6400000,500000],["952",950000,50000],["952",2000000,500000],["952",2600000,300000],["952",3500000,500000],["952",6650000,50000],["953",1400000,400000],["953",3400000,400000],["958",4445000,5000],["958",4550000,50000],["958",5180000,10000],["958",5280000,40000],["958",5370500,200],["958",5372000,1000],["958",5376035,1255],["958",5760000,10000],["958",5800000,10000],["958",7700000,100000],["958",7800000,100000],["960",2300000,600000],["961",6070000,60000],["961",8000000,120000],["962",3430000,40000],["962",3530000,20000],["962",3820000,30000],["962",6800000,500000],["963",2410000,90000],["963",3000000,220000],["963",3220000,80000],["963",3400000,100000],["964",3200000,100000],["964",3300000,100000],["964",3400000,100000],["964",3600000,400000],["964",6100000,50000],["965",0,1000000],["965",7470000,30000],["965",7500000,500000],["965",8130000,40000],["965",8180000,20000],["966",7500000,100000],["967",3400000,50000],["967",3460000,40000],["967",3570000,30000],["967",4320000,30000],["967",5100000,50000],["967",5200000,40000],["967",5300000,100000],["967",5500000,40000],["967",5600000,50000],["967",5700000,50000],["967",5900000,100000],["967",6250000,10000],["967",9670000,30000],["967",9730000,70000],["968",1800000,100000],["968",1900000,50000],["968",1950000,20000],["969",7000000,400000],["969",7900000,100000],["981",1000000,1000000],["981",2000000,300000],["981",6800000,200000],["981",7000000,1200000],["981",8200000,450000],["981",8700000,1300000],["991",0,170000],["991",9100000,100000],["991",9900000,40000],["991",9950000,50000],["999",45000,55000],["999",203000,97000],["999",303000,97000],["999",410000,140000],["999",560000,10000],["999",603000,97000],["999",810000,10000],["999",903000,47000],["999",1010000,40000],["999",1065000,25000],["999",1160000,40000],["999",1220000,10000],["999",1350000,10000],["999",1460000,40000],["999",1503000,45000],["999",1590000,30000],["999",1803000,35000],["999",1853000,35000],["999",1953000,37000],["999",2000000,200000],["999",2202000,98000],["999",2313000,87000],["999",2402000,98000],["999",5103000,297000],["999",6680000,20000],["999",7790000,9000],["999",9400000,10000]],
		msk: [["900",7000000,500000],["900",9000000,10000],["901",1800000,100000],["901",4000000,100000],["901",4200000,100000],["901",4610000,10000],["901",4640000,10000],["901",4700000,10000],["901",5000000,1000000],["901",7000000,1000000],["901",9000000,100000],["901",9820000,10000],["901",9830000,10000],["903",0,200000],["903",1000000,1000000],["903",2000000,1000000],["903",3630000,10000],["903",5000000,1000000],["903",6100000,200000],["903",6600000,300000],["903",7000000,1000000],["903",9600000,200000],["905",5000000,1000000],["905",7000000,1000000],["906",0,1000000],["906",7000000,1000000],["909",1500000,200000],["909",6200000,800000],["909",9000000,1000000],["910",0,60000],["910",80000,20000],["910",130000,10000],["910",150000,10000],["910",190000,10000],["910",480000,30000],["910",810000,90000],["910",4000000,1000000],["915",0,5000000],["916",0,10000000],["917",5000000,1000000],["919",1000000,100000],["919",1390000,10000],["919",4100000,20000],["919",7200000,100000],["919",7600000,200000],["919",7840000,10000],["919",7860000,10000],["919",9600000,100000],["919",9700000,10000],["919",9900000,100000],["925",0,6430000],["925",6430000,30000],["925",6460000,10000],["925",6470000,160000],["925",6630000,30000],["925",6660000,310000],["925",7000000,2210000],["925",9220000,270000],["925",9600000,20000],["925",9670000,40000],["925",9740000,10000],["925",9850000,10000],["925",9910000,10000],["925",9970000,30000],["926",0,10000000],["929",5000000,2000000],["929",9000000,1000000],["936",0,10000],["936",6000000,10000],["936",7770000,10000],["941",1000000,5000],["941",8100000,5000],["958",1110000,10000],["958",3000000,140000],["958",3348000,428000],["958",3896000,4000],["958",5000000,80000],["958",5190000,10000],["958",5200000,10000],["958",5230000,10000],["958",5240000,40000],["958",5340000,10000],["958",5350000,10000],["958",5370300,200],["958",5371000,1000],["958",5374100,1935],["958",5385000,1000],["958",5411150,10],["958",5550000,10000],["958",5770000,10000],["958",5920000,10000],["958",6300000,145000],["958",7000000,700000],["958",8800000,10000],["958",8880000,10000],["958",8900000,100000],["958",9000000,1000000],["962",3600000,100000],["962",9000000,1000000],["963",6000000,1000000],["963",7100000,40000],["963",7140000,60000],["963",7200000,100000],["963",7500000,10000],["963",7510000,90000],["963",7600000,300000],["963",9200000,100000],["963",9600000,200000],["963",9900000,100000],["964",5000000,400000],["964",5500000,500000],["964",6200000,300000],["964",7000000,300000],["964",7600000,100000],["964",7700000,300000],["965",1000000,1000000],["965",2000000,500000],["965",2500000,2000000],["966",0,1000000],["966",1000000,1000000],["966",3000000,1000000],["967",0,3000000],["968",0,1000000],["968",3100000,100000],["968",3200000,200000],["968",3400000,100000],["968",3500000,4500000],["968",8000000,2000000],["969",0,90000],["969",100000,900000],["969",1000000,1000000],["969",2000000,850000],["969",3000000,400000],["969",3400000,100000],["969",6800000,200000],["985",1000000,1193000],["985",2200000,1000000],["985",3300000,400000],["985",3800000,1130000],["985",6000000,10000],["985",6040000,10000],["985",6100000,300000],["985",6400000,100000],["985",6550000,2000],["985",6600000,100000],["985",6800000,200000],["985",7000000,10000],["985",7040000,10000],["985",7100000,100000],["985",7200000,100000],["985",7300000,300000],["985",7600000,1400000],["985",9040000,10000],["985",9050000,10000],["985",9100000,200000],["985",9600000,200000],["985",9900000,100000],["997",1000000,10000],["997",1010000,10000],["997",1020000,10000],["997",1030000,10000],["997",1040000,10000],["997",1050000,10000],["997",1060000,10000],["997",1070000,10000],["997",1080000,10000],["997",1090000,10000],["997",1100000,10000],["997",1110000,10000],["997",1120000,10000],["997",1130000,10000],["997",1140000,10000],["997",1150000,10000],["997",1160000,10000],["997",1170000,10000],["997",1180000,10000],["997",1190000,10000],["997",1200000,10000],["997",1210000,10000],["997",1220000,10000],["997",1230000,10000],["997",1240000,10000],["997",1250000,10000],["997",1260000,10000],["997",1270000,10000],["997",1280000,10000],["997",1290000,10000],["997",1300000,10000],["997",1310000,10000],["997",1320000,10000],["997",1330000,10000],["997",1340000,10000],["997",1350000,10000],["997",1360000,10000],["997",1370000,10000],["997",1380000,10000],["997",1390000,10000],["997",1400000,10000],["997",1410000,10000],["997",1420000,10000],["997",1430000,10000],["997",1440000,10000],["997",1450000,10000],["997",1460000,10000],["997",1470000,10000],["997",1480000,10000],["997",1490000,10000],["997",1500000,10000],["997",1510000,10000],["997",1520000,10000],["997",1530000,10000],["997",1540000,10000],["997",1550000,10000],["997",1560000,10000],["997",1570000,10000],["997",1580000,10000],["997",1590000,10000],["997",1600000,10000],["997",1610000,10000],["997",1620000,10000],["997",1630000,10000],["997",1640000,10000],["997",1650000,10000],["997",1660000,10000],["997",1670000,10000],["997",1680000,10000],["997",1690000,10000],["997",1710000,10000],["997",1720000,10000],["997",1730000,10000],["997",1740000,10000],["997",1750000,10000],["997",1760000,10000],["997",1770000,10000],["997",1780000,10000],["997",1790000,10000],["997",1800000,10000],["997",1810000,10000],["997",1820000,10000],["997",1830000,10000],["997",1840000,10000],["997",1850000,10000],["997",1860000,10000],["997",1870000,10000],["997",1880000,10000],["997",1890000,10000],["997",1900000,10000],["997",1910000,10000],["997",1920000,10000],["997",1930000,10000],["997",1940000,10000],["997",1950000,10000],["997",1960000,10000],["997",1970000,10000],["997",1980000,10000],["997",1990000,10000],["997",6000000,10000],["997",6010000,10000],["997",6020000,10000],["997",6030000,10000],["997",6040000,10000],["997",6050000,10000],["997",6060000,10000],["997",6070000,10000],["997",6080000,10000],["997",6090000,10000],["997",6100000,10000],["997",6110000,10000],["997",6120000,10000],["997",6130000,10000],["997",6140000,10000],["997",6150000,10000],["997",6160000,10000],["997",6170000,10000],["997",6180000,10000],["997",6190000,10000],["997",6200000,10000],["997",6210000,10000],["997",6220000,10000],["997",6230000,10000],["997",6240000,10000],["997",6250000,10000],["997",6260000,10000],["997",6270000,10000],["997",6280000,10000],["997",6290000,10000],["997",6300000,10000],["997",6310000,10000],["997",6320000,10000],["997",6330000,10000],["997",6340000,10000],["997",6350000,10000],["997",6360000,10000],["997",6370000,10000],["997",6380000,10000],["997",6390000,10000],["997",6400000,10000],["997",6410000,10000],["997",6420000,10000],["997",6430000,10000],["997",6440000,10000],["997",6450000,10000],["997",6460000,10000],["997",6470000,10000],["997",6480000,10000],["997",6490000,10000],["997",6510000,10000],["997",6520000,10000],["997",6530000,10000],["997",6540000,10000],["997",6550000,10000],["997",6560000,10000],["997",6570000,10000],["997",6580000,10000],["997",6590000,10000],["997",6600000,10000],["997",6610000,10000],["997",6620000,10000],["997",6630000,10000],["997",6640000,10000],["997",6650000,10000],["997",6660000,10000],["997",6670000,10000],["997",6680000,10000],["997",6690000,10000],["997",6710000,10000],["997",6720000,10000],["997",6730000,10000],["997",6740000,10000],["997",6750000,10000],["997",6760000,10000],["997",6770000,10000],["997",6780000,10000],["997",6790000,10000],["997",6800000,10000],["997",6810000,10000],["997",6820000,10000],["997",6830000,10000],["997",6840000,10000],["997",6850000,10000],["997",6860000,10000],["997",6870000,10000],["997",6880000,10000],["997",6890000,10000],["997",6900000,10000],["997",6910000,10000],["997",6920000,10000],["997",6930000,10000],["997",6940000,10000],["997",6950000,10000],["997",6960000,10000],["997",6970000,10000],["997",6980000,10000],["997",6990000,10000],["999",0,3000],["999",3000,2000],["999",5000,40000],["999",103000,97000],["999",950000,21000],["999",989000,11000],["999",1110000,40000],["999",2302000,1000],["999",2763000,37000],["999",2803000,45000],["999",2853000,47000],["999",2903000,45000],["999",3330000,10000],["999",3348000,50000],["999",3403000,97000],["999",3503000,95000],["999",3603000,182000],["999",3803000,177000],["999",4440000,10000],["999",5003000,95000],["999",5403000,70000],["999",5503000,87000],["999",5717000,93000],["999",5903000,97000],["999",6015000,85000],["999",6103000,137000],["999",6400000,100000],["999",6580000,20000],["999",6605000,55000],["999",6660000,20000],["999",6703000,97000],["999",6815000,55000],["999",6903000,7000],["999",7110000,90000],["999",7403000,7000],["999",7653000,35000],["999",7710000,30000],["999",7770000,10000],["999",7799000,1000],["999",7803000,90000],["999",7903000,90000],["999",8000000,500000],["999",8500000,300000],["999",8800000,500000],["999",9500000,100000],["999",9600000,200000],["999",9800000,200000]],
		other: [["901",4940000,10000],["902",2010000,10000],["902",2020000,10000],["904",9500000,10000],["904",9510000,10000],["904",9520000,10000],["904",9530000,10000],["904",9540000,10000],["954",0,2000],["954",300000,100000],["954",500000,100000],["954",700000,100000],["954",1000000,10000],["954",1010000,10000],["954",1020000,20000],["954",1040000,5000],["954",1050000,10000],["954",2000000,1000000],["954",9000000,100000],["954",9900000,100000],["956",7000,1000],["970",1010000,1000],["970",1230000,10000],["970",3000000,10000],["970",3500000,10],["970",5005000,10],["970",5005010,1],["970",5005020,1],["970",5005030,1],["970",5005040,1],["970",5005050,1],["970",5005060,1],["970",5005070,1],["970",5005080,1],["970",5005090,1],["970",5005555,1],["970",7070000,10000],["971",1010101,1],["971",3000000,10000],["971",3500000,10],["971",5005000,10],["971",5005010,1],["971",5005020,1],["971",5005030,1],["971",5005040,1],["971",5005050,1],["971",5005060,1],["971",5005070,1],["971",5005080,1],["971",5005090,1],["971",5005555,1],["971",7070000,10000]]		
	}
	
};

function randomItem(array) {
	return array[Math.floor(array.length * Math.random())];
}

function random(from, to) {
	return from + Math.floor((to-from) * Math.random());
}

// Преобразует число в строку с минимальной длиной 2
function toFixed(i) {
	if (i.toString().length == 1) {
		return "0" + i;
	} else {
		return "" + i;
	}
}

// Случайная точка в радиусе от другой
function randomDot (x, y, R) {
	var r = Math.random()*R;
	var a = Math.PI - Math.random()*2*Math.PI;

	return {x: x + (Math.cos(a) * r), y: y + (Math.sin(a) * r)}
}

// Сокращение document.getElementById
function $(a){return document.getElementById(a)};

// Функция, генерирующая легкозапоминаемые пароли. 
// Проверьте сами: https://jsfiddle.net/paulll/vrGE6/
function genWord() {

	function rand(max) {
		return Math.floor(Math.random() * (max + 1));
	}

	var chars_1 = "qwrtpsdfghjklzxcvnm".split('');
	var chars_2 = "eyuioa".split('');

	var word = '';

	var state = 0;

	var length = 4 + rand(7);

	for (var i = 0; i < length; i++) {
		if (state == 0) {
			word = word + chars_1[rand(chars_1.length - 1)];
			if (rand(5) !== 2) {
				state = 1;
			}
		} else {
			word = word + chars_2[rand(chars_2.length - 1)];
			if (rand(20) !== 2) {
				state = 0;
			}
		}
	}

	return word;
}

function translit(e) {
	var arr={'а':'a', 'б':'b', 'в':'v', 'г':'g', 'д':'d', 'е':'e', 'ж':'g', 'з':'z', 'и':'i', 'й':'y', 'к':'k', 'л':'l', 'м':'m', 'н':'n', 'о':'o', 'п':'p', 'р':'r', 'с':'s', 'т':'t', 'у':'u', 'ф':'f', 'ы':'i', 'э':'e', 'А':'A', 'Б':'B', 'В':'V', 'Г':'G', 'Д':'D', 'Е':'E', 'Ж':'G', 'З':'Z', 'И':'I', 'Й':'Y', 'К':'K', 'Л':'L', 'М':'M', 'Н':'N', 'О':'O', 'П':'P', 'Р':'R', 'С':'S', 'Т':'T', 'У':'U', 'Ф':'F', 'Ы':'I', 'Э':'E', 'ё':'yo', 'х':'h', 'ц':'ts', 'ч':'ch', 'ш':'sh', 'щ':'shch', 'ъ':'', 'ь':'', 'ю':'yu', 'я':'ya', 'Ё':'YO', 'Х':'H', 'Ц':'TS', 'Ч':'CH', 'Ш':'SH', 'Щ':'SHCH', 'Ъ':'', 'Ь':'', 'Ю':'YU', 'Я':'YA'};
	return e.replace(/[А-яёЁ]/g, function(a){return arr[a]||a});
}          

function main () {

	var zone, login, person = {};

	person.color = randomItem(dicts.colors);

	if (Math.random() > 0.5) {
		if (Math.random() > 0.5) {
			zone = 'spb';
		} else {
			zone = 'msk';
		}
	} else {
		zone = 'other';
	}

	if (Math.random() > 0.5) {
		person.name = [dicts.fe.lastnames, dicts.fe.firstnames, dicts.fe.midnames].map(randomItem).join(' ');
	} else {
		person.name = [dicts.ma.lastnames, dicts.ma.firstnames, dicts.ma.midnames].map(randomItem).join(' ');
	}

	var tel = randomItem(dicts.tel[zone]);

	person.telephone = "+7"+tel.shift()+(tel.shift() + Math.floor(tel.shift()*Math.random()));

	person.dateOfBirth = [random(0, 27) + 1, random(0, 11) + 1, random(1960, 1999)].map(toFixed).join('.');

	person.password = Math.random() > 0.3 ? genWord() : genWord() + person.dateOfBirth.slice(-2);

	if (Math.random() > 0.3) {
		if (Math.random() > 0.5) {			
			login = [person.name.split(' ')[1], person.name.split(' ')[0], Math.random()>0.4?person.dateOfBirth.slice(-2):''].map(translit).join('');
		} else {
			login = [person.name.split(' ')[0], person.name.split(' ')[1], Math.random()>0.4?person.dateOfBirth.slice(-2):''].map(translit).join('');
		}
	} else {
		login = [Math.random()>0.7?person.name.split(' ')[1]:person.name.split(' ')[0], Math.random()>0.1?person.dateOfBirth.slice(-2):''].map(translit).join('');
	}

	// Лучше написать логин, т.к. почту автоматически регистрировать мне лень
	person.email = login; // + randomItem('@google.com @mail.ru @bk.ru @list.ru @ya.ru @yandex.ru @rambler.ru @inbox.ru'.split(' '));

	dicts.addr[zone](function (e) {

		person.address = e;

		$('name').value = person.name;
		$('color').value = person.color;
		$('address').value = person.address;
		$('date').value = person.dateOfBirth;
		$('tel').value = person.telephone;
		$('email').value = person.email;		
		$('passw').value = person.password;

	});

}

main();
// wut?
